[
  { 
    "id": 0,
    "name": "0. Welcome! Pick a different move to show here ...",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MSVlGUC11TWxNUDg",
    "description": "Welcome to Tango for Dummies!",
    "tips": "Use the image above to navigate."
  },
  { 
    "id": 1,
    "name": "1. Weight change",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MckpnZmlDdk1kZ1k",
    "description": "This is known as the zeroth pattern for tango.",
    "tips": "Tips for leaders: \n \nRemember that your weight change's goal is to induce the follower's weight change, so you may have to make the shift bigger or smaller depending on your follower.  \n*ADVANCED* A follower's weight change actually has a 'shape', which is 'flat' as long as there is some weight on both of follower's feet.  As soon as all the weight is on only one of follower's foot, there is a very slight 'dip', which is your cue to weight change to other direction or start walking.  \n \nTips for followers: \n \nKeep your heels as close as possible! The reason for this is you want to stay as tall as possible during weight changes; height change is actually an effective technique to convey intention to your tango partner. To be honest though, I keep my heels together for weight changes just because it looks better 😀"  
  },
   { 
    "id": 2,
    "name": "2. Parellel walking",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MNWVFTTRrb282QVU",
    "description": "Beautiful walking is beautiful tango.  Remember that.",
    "tips": "Tips for leaders: \n \nMove from your center! Imagine you're pulling a person tied to your waist.  Actually, stop imagining this and try this out! Use a bath towel (or a beat-up jacket) to hack a makeshift towing waist harness, and ask one of your minion friends to hold the ends of the towel and stand still two feet behind you.  Try to tow your friend in a smooth manner.  This is the feeling for a great walking lead.  \n*ADVANCED* Try moving your free foot a split second after the followers does.  \n \nTips for followers: \n \nI believe that it is mostly the follower's responsibility to let your leader know 'where you are', so please provide a little bit extra pressure when the leader is walking forward; this will also make you more stable.  \n*ADVANCED* If you wear high heels during dancing, get a more experienced follower to show you how to land on your whole foot, instead of landing on just the ball of your foot.  This is the trick to be able to dance all night.  "
  },
  {
    "id": 3,
    "name": "3. Cross walking",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MSUxzaWdFbjNITjg", 
    "description": "Cross system walking in a tango specialty.  Unless you're an ice-skater.",
    "tips": "Tips for leaders: \n \nTry to point your chest at your follower always.  *ADVANCED* There is an inline/inside version of cross walking that is harder than two shown; I only use it to set up reverse sandwich parada though.  \n \nTips for followers: prepare a well-written speech for when your leader accidentally step on you 😒.  "
  },
  {
    "id": 4,
    "name": "4. Cruzada",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MOWRGWDNRVW90aVU", 
    "description": "A small cross is a good cross.",
    "tips": "Tips for leaders: \n \nAn ocho cortado is a much more intuitive way to lead into 'cross' in my opinion.  For the 8-count basic way, remember that you are still walking straight forward but utilizing you chest rotation (dissociation) to bring the follower back in front of you at the end of the 'cross.  \n \nTips for followers: for the 8-count basic way, take a larger step right before the 'cross' happens, to create more room for the 'cross'.  It is tricky to figure out if you should weight-transfer to your front foot after the 'cross', in most cases it's safer to transfer right away.  "
  },
  {
    "id": 5,
    "name": "5. Gancho",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MbWNwcjhFX00wUlE",
    "description": "A gancho puts the mingle into tango.",
    "tips": "Tips for leaders: \n \ntry to have as little weight as possible on your 'hooking' leg; you may need to bend your standing leg (for shorter follower) or raise the 'hooking leg (for much taller follower).  \n \nTips for followers: \n \nPlease swing your whole leg instead of just your calf; leaders don't wear groin protectors to tango.  "
  },
  {
    "id": 6,
    "name": "6. Parada pasada",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MTlBKR2dsZmdaS3M",
    "description": "The 'pass-over' is usually the first fun move you'll learn.",
    "tips": "Tips for leaders: \n \nMake sure the follower knows your foot obstacle is there, by physical contact, not by psychic connection. \n \nTips for followers: \n \nI believe that followers should get to play here for a few seonds, unless it creates a traffic jam, in which case, make sure to look extra gud cuz' people watchin'.  "
  },
  {
    "id": 7,
    "name": "7. Ocho",
    "url": "http://www.virtuar.com/tango/theory/2014/20141008_focho4_sm.png",
    "description":"The famous figure-8 core exercise.",
    "tips": "Tips for leaders: \n \nUse your spine, not your arms, to make ochos happen.  A ocho led entirely by arms is known as an 'oucho'.  \n \nTips for followers: \n \nfor forward ochos, utilize the 'unwinding' of your core to pivot easier; for back ochos, use both your own core and your leader for pivoting.  "
  },
  {
    "id":8,
    "name": "8. Giro/Molinete",
    "url":"https://s-media-cache-ak0.pinimg.com/originals/8f/71/10/8f71102accf5e6eff2cfc67c81d122b1.gif",
    "description": "What is fancy tango without turns and spins?",
    "tips": "Tips for leaders: \n \nengage your back muscles, which will prevent over-using your arms and help keep your upper body quiet. \n \nTips for followers: as a leader, I subconciously distinguish intermediate followers from beginner followers by the quality of the follower's giro/molinete; that is becaue giros/molinetes are difficult.  There are three important points (don't rush, take long steps, and be consistent).  Practice with chair.  For the close embrace version, replace the back step with a back cross, and, optionally, replace the forward step with a front cross.  *ADVANCED* followers, to get around your leader faster, stay extra light during the back step(don't transfer all your weight).  "
  }, 
  {
    "id":9,
    "name": "9. Rock Step Turn",
    "url": "https://drive.google.com/uc?export=download&id=0BzybsaJP9M7MRjFZOEllTzZqOUk",
    "description": "Counter-clockwise rock step turns are so simple and useful",
    "tips": "Tips for leaders: \n \nfor the rock step, take a smaller step than you think you need.  In fact, the smaller the rock step, the more turn you can get out of it. \n \nTips for followers:\n \nthink of rock steps as a dynamic weight change, so take your time.  "
  }
]